# Lyft Trip Data

## The project details:
Suppose you are a Data Analyst at Lyft, a ride-sharing platform. For a project, you were given three tables:

trips: trips information
riders: user data
cars: autonomous cars

In [ ]:
-- 1 Let’s examine the three tables.
-- SELECT * FROM trips;
-- SELECT * FROM riders;
-- SELECT * FROM cars;

SELECT * FROM trips;
SELECT * FROM riders;
SELECT * FROM cars;

-- Results

Query Results
id	date	pickup	dropoff	rider_id	car_id	type	cost
1001	2017-12-05	06:45	07:10	102	1	X	28.66
1002	2017-12-05	08:00	08:15	101	3	POOL	9.11
1003	2017-12-05	09:30	09:50	104	4	X	24.98
1004	2017-12-05	13:40	14:05	105	1	X	31.27
1005	2017-12-05	15:15	16:00	103	2	POOL	18.95
1006	2017-12-05	18:20	18:55	101	3	XL	78.52
id	first	last	username	rating	total_trips	referred
101	Sonny	Li	@sonnynomnom	4.66	352	
102	Laura	Breiman	@lauracle	4.99	687	101
103	Kassa	Korley	@kassablanca	4.63	42	
104	Yakov	Kagan	@yakovkagan	4.52	1910	103
id	model	OS	status	trips_completed
1	Ada	Ryzac	active	82
2	Ada	Ryzac	active	30
3	Turing XL	Ryzac	active	164
4	Akira	Finux	maintenance	22

In [ ]:
-- 2 Try out a simple cross join between riders and cars.
SELECT * FROM riders CROSS JOIN cars;

-- Results

Query Results
id	first	last	username	rating	total_trips	referred	id	model	OS	status	trips_completed
101	Sonny	Li	@sonnynomnom	4.66	352		1	Ada	Ryzac	active	82
101	Sonny	Li	@sonnynomnom	4.66	352		2	Ada	Ryzac	active	30
101	Sonny	Li	@sonnynomnom	4.66	352		3	Turing XL	Ryzac	active	164
101	Sonny	Li	@sonnynomnom	4.66	352		4	Akira	Finux	maintenance	22
102	Laura	Breiman	@lauracle	4.99	687	101	1	Ada	Ryzac	active	82
102	Laura	Breiman	@lauracle	4.99	687	101	2	Ada	Ryzac	active	30
102	Laura	Breiman	@lauracle	4.99	687	101	3	Turing XL	Ryzac	active	164
102	Laura	Breiman	@lauracle	4.99	687	101	4	Akira	Finux	maintenance	22
103	Kassa	Korley	@kassablanca	4.63	42		1	Ada	Ryzac	active	82
103	Kassa	Korley	@kassablanca	4.63	42		2	Ada	Ryzac	active	30
103	Kassa	Korley	@kassablanca	4.63	42		3	Turing XL	Ryzac	active	164
103	Kassa	Korley	@kassablanca	4.63	42		4	Akira	Finux	maintenance	22
104	Yakov	Kagan	@yakovkagan	4.52	1910	103	1	Ada	Ryzac	active	82
104	Yakov	Kagan	@yakovkagan	4.52	1910	103	2	Ada	Ryzac	active	30
104	Yakov	Kagan	@yakovkagan	4.52	1910	103	3	Turing XL	Ryzac	active	164
104	Yakov	Kagan	@yakovkagan	4.52	1910	103	4	Akira	Finux	maintenance	22

In [ ]:
-- 3 Suppose we want to create a Trip Log with the trips and its users.
-- Find the columns to join between trips and riders and combine the two tables using a LEFT JOIN.
-- Let trips be the left table.
SELECT * FROM trips LEFT JOIN riders ON trips.rider_id = riders.id;

-- Results

Query Results
id	date	pickup	dropoff	rider_id	car_id	type	cost	id	first	last	username	rating	total_trips	referred
1001	2017-12-05	06:45	07:10	102	1	X	28.66	102	Laura	Breiman	@lauracle	4.99	687	101
1002	2017-12-05	08:00	08:15	101	3	POOL	9.11	101	Sonny	Li	@sonnynomnom	4.66	352	
1003	2017-12-05	09:30	09:50	104	4	X	24.98	104	Yakov	Kagan	@yakovkagan	4.52	1910	103
1004	2017-12-05	13:40	14:05	105	1	X	31.27							
1005	2017-12-05	15:15	16:00	103	2	POOL	18.95	103	Kassa	Korley	@kassablanca	4.63	42	
1006	2017-12-05	18:20	18:55	101	3	XL	78.52	101	Sonny	Li	@sonnynomnom	4.66	352

In [ ]:
-- 4 Suppose we want to create a link between the trips and the cars used during those trips.
-- Find the columns to join on and combine the trips and cars table using an INNER JOIN.
SELECT * FROM trips JOIN cars ON trips.car_id = cars.id;

-- Results

Query Results
id	date	pickup	dropoff	rider_id	car_id	type	cost	id	model	OS	status	trips_completed
1001	2017-12-05	06:45	07:10	102	1	X	28.66	1	Ada	Ryzac	active	82
1002	2017-12-05	08:00	08:15	101	3	POOL	9.11	3	Turing XL	Ryzac	active	164
1003	2017-12-05	09:30	09:50	104	4	X	24.98	4	Akira	Finux	maintenance	22
1004	2017-12-05	13:40	14:05	105	1	X	31.27	1	Ada	Ryzac	active	82
1005	2017-12-05	15:15	16:00	103	2	POOL	18.95	2	Ada	Ryzac	active	30
1006	2017-12-05	18:20	18:55	101	3	XL	78.52	3	Turing XL	Ryzac	active	164

In [ ]:
-- 5 The new riders data are in! There are three new users this month.
-- Stack the riders table on top of the new table named riders2.

SELECT * FROM riders UNION SELECT * FROM riders2;

-- Results

Query Results
id	first	last	username	rating	total_trips	referred
101	Sonny	Li	@sonnynomnom	4.66	352	
102	Laura	Breiman	@lauracle	4.99	687	101
103	Kassa	Korley	@kassablanca	4.63	42	
104	Yakov	Kagan	@yakovkagan	4.52	1910	103
105	Zach	Sims	@zsims	4.85	787	
106	Eric	Vaught	@posturelol	4.96	54	101
107	Jilly	Beans	@jillkuzmin	4.7	32	101

In [ ]:
-- 6 What is the average cost for a trip?
SELECT AVG(cost) FROM trips;

-- Results

Query Results
AVG(cost)
31.915

In [ ]:
-- 7 Lyft is looking to do an email campaign for all the irregular users.
-- Find all the riders who have used Lyft less than 500 times!
SELECT * FROM riders WHERE total_trips < 500;

-- Results

Query Results
id	first	last	username	rating	total_trips	referred
101	Sonny	Li	@sonnynomnom	4.66	352	
103	Kassa	Korley	@kassablanca	4.63	42

In [ ]:
-- 8 Calculate the number of cars that are active.
SELECT * FROM cars WHERE status= 'active';

-- Results

Query Results
id	model	OS	status	trips_completed
1	Ada	Ryzac	active	82
2	Ada	Ryzac	active	30
3	Turing XL	Ryzac	active	164

In [ ]:
-- 9 It’s safety recall time for cars that have been on the road for a while.
-- Write a query that finds the two cars that have the highest trips_completed.
SELECT * FROM cars ORDER BY trips_completed DESC LIMIT 2;

-- Results

Query Results
id	model	OS	status	trips_completed
3	Turing XL	Ryzac	active	164
1	Ada	Ryzac	active	82

## Review
It is a very nice database to begin learning and practising your skills on linking different tables.